
Процедура ПередЗаписью(Отказ)

	МассивАдресов = Получатели.ВыгрузитьКолонку("ЭлектроннаяПочта");
	Получатель = СтрСоединить(МассивАдресов, "; ");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Если заполнено поле "Получатель"
	Если ПустаяСтрока(Получатель) Тогда

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Необходимо указать Получатель'", "ru");
		Сообщение.Поле  = "Получатель";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();

	КонецЕсли;

КонецПроцедуры
