
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Пользователь = Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Пользователь = ДанныеЗаполнения.Владелец;
		Если Пользователь = Неопределено Тогда
			Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		КонецЕсли;
		
	Иначе
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Владелец = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(Описание) Тогда

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Необходимо указать описание'", "ru");
		Сообщение.Поле  = "Описание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();

	КонецЕсли;
	
	Если Окончание < Начало Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Дата окончания не может быть меньше даты начала.'", "ru");
		Сообщение.Поле  = "Окончание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
